/*******************************************************************************
//  版权所有    2012 华为技术有限公司
//  程 序 集：  IVS_Player
//  文 件 名：  RecorderAPI.h
//  文件说明:   本地录像接口
//  版    本:  IVS V100R002C01
//  作    者:  w00210470
//  创建日期:   2012/12/18
//  修改标识：
//  修改说明：
*******************************************************************************/
#ifndef __IVS_PLAYER_RECORDER_API_H__
#define __IVS_PLAYER_RECORDER_API_H__ 

#include "IVSPlayerDataType.h"



/*****************************************************************************
函数名称：Recorder_LibInit
功能描述：初始化本地录像资源
输入参数：NA  
输出参数：NA
返 回 值：int
 *****************************************************************************/
int  Recorder_LibInit();

/*****************************************************************************
函数名称：Recorder_LibClean
功能描述：清理本地录像资源
输入参数：NA  
输出参数：NA
返 回 值：int
 *****************************************************************************/
void Recorder_LibClean();

/*****************************************************************************
函数名称：Recorder_SetConfParam
功能描述：设置录像参数
输入参数：
	@pConf       参数结构体指针
输出参数：NA
返 回 值：int
 *****************************************************************************/
int Recorder_SetConfParam(RECORD_CONFIG *pConf);

/*****************************************************************************
函数名称：Recorder_GetConfParam
功能描述：设置录像参数
输入参数：
	@pConf   参数结构体缓存
输出参数：NA
返 回 值：int
 *****************************************************************************/
int Recorder_GetConfParam(const RECORD_CONFIG *pConf);

/*****************************************************************************
函数名称：Recorder_GetHandle
功能描述：获取本地录像句柄
输入参数：
输出参数：NA
返 回 值：int
 *****************************************************************************/
IVS_HANDLE Recorder_GetHandle(); 

/*****************************************************************************
函数名称：Recorder_FreeHandle
功能描述：释放本地录像句柄
输入参数：
    @IVS_HANDLE  句柄
输出参数：NA
返 回 值：int
 *****************************************************************************/
int Recorder_FreeHandle(IVS_HANDLE h);

/*****************************************************************************
函数名称：Recorder_Init
功能描述：初始化录像
输入参数：
    @IVS_HANDLE  句柄
输出参数：NA
返 回 值：int
 *****************************************************************************/
int Recorder_Init(IVS_HANDLE h, const char *pCameCode, const char *pCamName, const char *pFname, 
	      const IVS_LOCAL_RECORD_PARAM *pPram, bool bAssociatedAudio, DOWNLOAD_PARAM *pDLParam);

/*****************************************************************************
函数名称：Recorder_InputFrame
功能描述：输入媒体流数据
输入参数：
    @IVS_HANDLE  录像句柄
	@pData       数据指针
	@len         数据长度
	@Type        帧类型
	@Ts          时间戳
输出参数：NA
返 回 值：int
 *****************************************************************************/
int Recorder_InputFrame(IVS_HANDLE h, const char *pData, unsigned int len, int Type, unsigned int Ts);

/*****************************************************************************
函数名称：Recorder_Start
功能描述：启动本地录像
输入参数：
    @IVS_HANDLE  句柄
输出参数：NA
返 回 值：int
 *****************************************************************************/
int Recorder_Start(IVS_HANDLE h);

/*****************************************************************************
函数名称：Recorder_Stop
功能描述：停止本地录像
输入参数：
    @IVS_HANDLE  句柄
输出参数：NA
返 回 值：int
 *****************************************************************************/
int Recorder_Stop(IVS_HANDLE h);

/*****************************************************************************
函数名称：Recorder_Pause
功能描述：停止本地录像
输入参数：
    @IVS_HANDLE  句柄
输出参数：NA
返 回 值：int
 *****************************************************************************/
int Recorder_Split(IVS_HANDLE h);

/*****************************************************************************
函数名称：Recorder_SetExceptionCallback
功能描述：设置本地录像异常回调
输入参数：
输出参数：NA
返 回 值：int
 *****************************************************************************/
int Recorder_SetExceptionCallback(IVS_HANDLE h, PLAYER_EXCEPTION_CALLBACK cb, void *pUserData);

/*****************************************************************************
函数名称：Recorder_GetStatis
功能描述：获取录像统计信息
输入参数：
输出参数：NA
返 回 值：int
*****************************************************************************/
int Recorder_GetStatis(IVS_HANDLE h, unsigned int *pTime, unsigned int *pSpeed, unsigned long long *pTotalSz);

#endif // __IVS_PLAYER_RECORDER_API_H__












